Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбменСGoogleПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//	Общие серверные процедуры для работы со службами Google (переопределяемый)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает наименование события Google календаря по ссылке на заявку.
//
// Параметры:
//  ИсточникСсылка	 - Документ Заявка - 
//  Сотрудник			 - СправочникСсылка Сотрудники -
//  ТЗРаботы		 - ТЗ Сотрудник|номенклатура -
// 
// Возвращаемое значение:
// Строка  -  сформированное описание события
//
Функция ПолучитьНаименованиеСобытия(ИсточникСсылка, Сотрудник, ТЗРаботы) Экспорт
	
	Наименование = "";
	
	Если РаботаСКлиентамиПереопределяемый.ЭтоГрупповаяЗаявка(ИсточникСсылка) Тогда
		Наименование = "Групповая заявка ";
	Иначе
		Наименование = СформироватьПредставлениеКлиента(ИсточникСсылка.Клиент) + " ";
	КонецЕсли;
	
	СтрокиРаботыСотрудника = ТЗРаботы.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник)); 
	Если СтрокиРаботыСотрудника.Количество() > 1 Тогда 
			Наименование = Наименование + Строка(СтрокиРаботыСотрудника[0].Номенклатура) + " (+" + Строка(СтрокиРаботыСотрудника.Количество()-1)+")"; 	// %Клиент% %Процедура% (+2)
	ИначеЕсли СтрокиРаботыСотрудника.Количество() = 1 Тогда
		Наименование = Наименование + Строка(СтрокиРаботыСотрудника[0].Номенклатура);																	// %Клиент% %Процедура%	
	КонецЕсли;
	
	Возврат Наименование;

КонецФункции

// Функция возвращает описание события Google календаря по ссылке на заявку.
//
// Параметры:
//  ИсточникСсылка	 - Документ Заявка - 
//  Сотрудник			 - СправочникСсылка Сотрудники -
//  ТЗРаботы		 - ТЗ Сотрудник|номенклатура -
// 
// Возвращаемое значение:
// Строка  -  сформированное описание события
//
Функция ПолучитьОписаниеСобытия(ИсточникСсылка, Сотрудник, ТЗРаботы) Экспорт
	
	Описание = "";
	
	Если РаботаСКлиентамиПереопределяемый.ЭтоГрупповаяЗаявка(ИсточникСсылка) Тогда
		Для Каждого КлиентСтрока Из ИсточникСсылка.Клиенты Цикл                                                                                   						// %Клиент% %Телефон%
			Описание = Описание + СформироватьПредставлениеКлиента(КлиентСтрока.Клиент, Истина) + Символы.ПС;	// %Клиент% %Телефон%
		КонецЦикла;                                                                                                                             						// %Клиент% %Телефон%
	Иначе
		Описание = СформироватьПредставлениеКлиента(ИсточникСсылка.Клиент, Истина) + Символы.ПС;				// %Клиент% %Телефон%
	КонецЕсли;

	Для каждого РаботаСтрока из ТЗРаботы.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник)) Цикл 
		Описание = Описание + Строка(РаботаСтрока.Номенклатура) + Символы.ПС;																							// %Услуга%
	КонецЦикла;
	
	Описание = Описание + ИсточникСсылка.Примечание;
	
	Возврат СокрЛП(Описание);

КонецФункции

// Функция возвращает место события Google календаря по ссылке на заявку.
//
// Параметры:
//  ИсточникСсылка	 - Документ Заявка - 
// 
// Возвращаемое значение:
// Строка  -  сформированное описание события
//
Функция ПолучитьМестоСобытия(ИсточникСсылка) Экспорт
	
	Описание = Строка(ИсточникСсылка.Филиал) + " ";
	Адрес = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ИсточникСсылка.Филиал,Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Если Адрес = Неопределено Тогда
		Адрес = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ИсточникСсылка.Филиал,Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	Описание = Описание + Строка(Адрес);
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьПредставлениеКлиента(Клиент, ЭтоОписание = Ложь)
	
	ШаблонПредставления = Константы.НастройкиФормированияПредставленияКлиентаGoogle.ПолучитьНастройкиФормированияНаименованияСобытияGoogle();
	Если ШаблонПредставления = "-" Тогда
		Возврат "";	
	КонецЕсли;
	
	КомпонентыШаблона = СтрРазделить(ШаблонПредставления, " ", Ложь);
	
	СтрокиЗамены = Новый Соответствие;
	СтрокиЗамены.Вставить("ФАМИЛИЯ",  СокрЛП(Клиент.Фамилия));
	СтрокиЗамены.Вставить("ИМЯ",	  СокрЛП(Клиент.Имя));
	СтрокиЗамены.Вставить("ОТЧЕСТВО", СокрЛП(Клиент.Отчество));
	СтрокиЗамены.Вставить("Ф.",		  Лев(Клиент.Фамилия, 1)  + ".");
	СтрокиЗамены.Вставить("И.",		  Лев(Клиент.Имя, 1)	  + ".");
	СтрокиЗамены.Вставить("О.",		  Лев(Клиент.Отчество, 1) + ".");
	СтрокиЗамены.Вставить("ТЕЛЕФОН",  КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Клиент, Перечисления.ТипыКонтактнойИнформации.Телефон));
	
	Представление = "";
	Для Каждого КомпонентШаблона Из КомпонентыШаблона Цикл
		
		ЗначениеКомпонента = СтрокиЗамены.Получить(КомпонентШаблона);
		Если ЗначениеКомпонента <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Представление, ЗначениеКомпонента, " ");
		КонецЕсли;
		
	КонецЦикла;
	
	Представление = СокрЛП(СтрЗаменить(Представление, "  ", " "));
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти
